# -*- coding: utf-8 -*-

# (if/elif/else)

# По номеру месяца вывести кол-во дней в нем (без указания названия месяца, в феврале 28 дней)
# Результат проверки вывести на консоль
# Если номер месяца некорректен - сообщить об этом

# Номер месяца получать от пользователя следующим образом
user_input = input("Введите, пожалуйста, номер месяца: ")
month = int(user_input)
print('Вы ввели', month)

if month > 12:
    print('Номер месяца введен некорректно')
elif month == 2:
    print('Количество дней в месяце', month, 'равно 28')
elif month == 4:
    print('Количество дней в месяце', month, 'равно 30')
elif month == 6:
    print('Количество дней в месяце', month, 'равно 30')
elif month == 9:
    print('Количество дней в месяце', month, 'равно 30')
elif month == 11 :
    print('Количество дней в месяце', month, 'равно 30')
else:
    print('Количество дней в месяце', month, 'равно 31')


