# -*- coding: utf-8 -*-

# (цикл while)

# даны целые положительные числа a и b (a > b)
# Определить результат целочисленного деления a на b, с помощью цикла while,
# __НЕ__ используя ни одной из операций деления: ни деления с плавающей точкой /, ни целочисленного деления //
# и взятия остатка %
# Формат вывода:
#   Целочисленное деление ХХХ на YYY дает ZZZ

a, b = 179, 37
count = 0
dividend = a
while a >= b:
    a -= b  # изменил оператор, так приятнее выглядит, как мне кажется)
    count += 1
print('Целочисленное деление', dividend, 'на', b, 'дает', count)

#зачет!